import random

import artifacts
import game
import skelet

# Западное испытание - choice1 == "1"
def zamok_game():
    artifacts.visited_locations.add("Старый замок")
    print("""Голова говорит вам идти на Запад к заброшенному старому замку, в 
котором заточена милая принцесса, и просит освободить бедняжку.
Вы подходите к воротам замка. Есть несколько вариантов, как попасть внутрь
1 - Отгадать код на замке\n2 - Сделать подкоп\n3 - Перелезть с помощью дерева
    """)
    choice2 = game.get_valid_input("Введите '1' или '2' или '3': ", ["1", "2", "3"])
    artifacts.log_move(f"Выбор преодаления ворот замка: {choice2}")

    if choice2 == "1":
        code = "1234"
        for attempts in range(5, 0, -1):
            guess = input(f"Введите код **** (осталось попыток: {attempts}): ")
            artifacts.log_move(f"Код сундука: {guess}")
            if guess == code:
                artifacts.visited_locations.add("Игра со скелетом")
                print("Ворота открылись и вы вошли внутрь, но на лестнице к принцессе вам путь преградил скелет...")
                skelet.skelet_game()
                return
            else:
                print("Неверный код.")
                k = random.randint(0,3)
                tips = [
                "Первая цифра - 1",
                "Вторая цифра - 2",
                "Третья цифра - 3",
                "Четвертая цифра - 4"]
                print(f"ПОДСКАЗКА:{tips[k]}")
        artifacts.return_artifact()
        game.end_game("Замок оказался сильнее вас...")

    if choice2 == "2":
        #Если ранее у скелета была забрана лопата - этот вариант будет дступен
        if "🪏 Лопата смерти" in artifacts.start_artifacts:
            print("""Вы прорыли дыру через ворота и уже приближаетесь к принцессе, но
            вдруг из-за угла появился скелет...
            """)
            skelet.skelet_game()
        else:
            print("К сожалению вам нечем копать проход...\nВаша миссия провалена(")
            game.end_game("А где лопата?...")

    if choice2 == "3":
        print("Вы залезли на дерево, но не удержали равновесие\nМиссия провалена")
        game.end_game("Лучше не лазать по деревьям")

